app/controllers/places_controller.rb

  def show
    @place = Place.find_by(:id => params["id"])
    @reviews = Review.where(:placeid => params["id"]).order(id: :desc)
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 1 LIMIT 1
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."placeid" = 1  ORDER BY "reviews"."id" DESC

  def delete
    @place = Place.find_by(:id => params["id"])
    if @place != nil
      @place.delete
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 5 LIMIT 1
DELETE FROM "places" WHERE "places"."id" = 5

  def create
    p = Place.new
    p[:title] = params["title"]
    p[:photo_url] = params["photo_url"]
    p[:admission_price] = params["price"].to_f * 100
    p[:description] = params["description"]
    p.save
---
INSERT INTO "places" ("admission_price", "description", "photo_url", "title") VALUES (?, ?, ?, ?)  [["admission_price", 123400], ["description", "12321312"], ["photo_url", "no"], ["title", "haha"]]

  def edit
    p = Place.find_by(:id => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 2 LIMIT 1

  def update
    p = Place.find_by(:id => params["id"])
    p[:title] = params["title"]
    p[:photo_url] = params["photo_url"]
    p[:admission_price] = params["price"].to_f * 100
    p[:description] = params["description"]
    p.save
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 2 LIMIT 1
UPDATE "places" SET "admission_price" = ? WHERE "places"."id" = 2  [["admission_price", 1400]]